use crate::engine::{Block, paragraph, subsection_header};

pub fn aifm() -> Block {
    Block::Placeholder(
        Box::new(Block::Multiple(vec![
            subsection_header("AIFM: High-Performance Application-Integrated Far Memory"),
            paragraph("Система Application-Integrated Far Memory була розроблена дослідниками з VMWare Research. У порівнянні з реалізаціями віддаленої памʼяті компанії Google, ця система має схожі та відмінні елементи."),
            paragraph("Головною відмінною рисою цієї реалізації є інтеграція з клієнтським програмним забезпеченням за допомогою клієнтської бібліотеки на C++ що надає розумні покажчики та структури даних оптимізовані для використання з віддаленою памʼяттю."),
            paragraph("Для спілкування між сервером що надає памʼять та сервером що її потребує використовується TCP/IP зʼєднання."),
            paragraph("Для виявлення ділянок памʼяті, що можна перенести у віддалену памʼять, використовується механізм відслідковування рівня гарячесті сторінок памʼяті. Також, для підвищення ефективності, структури даних визначені бібліотекою AIFM реалізують предзванатжання наступних ділянок памʼяті."),
            paragraph("Для цієї реалізації є доступним програмний код. Недоліком є те, що без додаткової доробки він підтримує лише один сервер що надає віддалену памʼять. Система не містить компоненту для розподілення та керування памʼяттю по кластеру вузлів. Також реалізація не є придатною для розгортання в середовищах що обробляють справжнє навантаження без додаткової доробки. Система має складний процес розгортання, залежить від зовнішніх компонентів, не має простих механізмів конфігурування та моніторингу."),
        ])),
        "improve AIFM description".to_owned(),
    )
}