use crate::thesis::engine::{Block, section_header, paragraph, SubsectionHeaderBlock, subsection_header, ImageBlock};

pub fn evaluation() -> Block {
    Block::Multiple(vec![
        section_header("Статистичне дослідження ефективності запропонованого методу"),
        paragraph("Статистичне дослідження ефективності запропонованого методу має на меті отримати відповіді на наступні запитання:"),
        Block::UnorderedList(vec![
            "Яким є рівень швидкодії типового програмного забезпечення з різними схемами доступу до оперативної памʼяті при викиорстанні віддаленої \
памʼяті?".into(),
            "Як залежить швидкодія програмного забезпечення що використовує віддалену памʼять від розподілу запитів до обʼєктів у памʼяті?".into(),
            "Яким є рівень швидкодії при використанні різних алгоритмів заміщення проміжків?".into(),
        ]),

        subsection_header("Програмне та апаратне забезпечення, що використовується для дослідження ефективності"),
        paragraph("Для того, щоб оцінити рівень швидкодії для різних типів програмного забезпечення, конфігурацій клієнта віддаленої памʼяті та \
алгоритмів заміщення проміжків, була проведена серія статистичних досліджень. Для цих досліджень було використано два сервери з наступним \
апаратним забезпеченням: процесор AMD Ryzen 5 3600, 64 Гб оперативної памʼяті, мережева карта Intel 82599 пропускною здатністю 10 Гбіт/c. \
При цьому, між серверами встановлено пряме мережеве зʼєднання: мережеві карти зʼєднані напряму, без використання додаткового мережевого обладнання, \
таких як маршрутизатори чи комутатори. На цих серверах встановлена операційна система ArchLinux з версією ядра 6.5."),
        paragraph("Віддалена памʼять бьула інтегрована у три синтетичні інформаційні системи, що були розроблені для цього дослідження."),
        paragraph("Першою такою інформаційною системою є програмне забезпечення для генерації тексту за допомогою великої мовленнєвої моделі Llama2. \
За основу була взята існуюча реалізація з відкритим кодом цієї програми на мові програмування Rust (llama2-rs). У віддалену \
памʼять було переміщено ваги нейронної мережі. Ця програма в циклі обробляє запити на \
генерацію наступного токена тексту. Показником швидкодії для цього програмного забезпечення є кількість згенерованих токенів у хвилину. Особливістю \
цієї програми є те, що під час генерації тексту відбувається циклічний доступ до усіх параметрів нейронної мережі у незмінному порядку. Це означає що \
цю програму можно віднести до класу програмного забезпечення, що багато разів сканує весь робочий набір даних у незмінному порядку."),
        paragraph("Крім цього, було реалізовано інформаційну систему веб сервісу, що обробляє запити від користувача. Ця програма є подібною до тієї, що \
використовувалась для оцінки ефективності у AIFM. Ця програма на початку своєї роботи генерує великий масив зображень, кожне з яких має розмір 8Кб. Крім \
цього, генерується набір користувачів, кожному з яких ставиться у відповідність одне з зображень. Обидві структури даних (масив та хеш-таблиця) \
зберігаються у віддаленій памʼяті. Під час своєї роботи, ця інформаційна система обробляє запити, кожен з яких складається з 32 випадкових ідентифікаторів \
користувачів. За кожним ідентифікатором користувача, веб сервіс отримує ідентифікатор зображення з хеш-таблиці. Серед усіх ідентифікаторів зображень у \
запиті обирається випадковий ідентифікатор, по якому отримається зображення з масиву зображень. Після цього, отримане зображення шифрується за допомогою \
AES GCM, стискається алгоритмом Snappy, після чого результат надсилається у відповідь на запит. Слід зазначити, що розподіл ідентифікаторів \
користувачів, а також відповідність зображень користувачам слідують розподіленню Ципфа з параметром s (за замовчуванням дорівнює 0.8). Показником \
швидкодії для цієї програми є кількість запитів що в середньому оброблено за секунду. Ця інформаційна система є прикладом програми з класу \
програмного забезпечення, що використовує сховище типу ключ-значення для зберігання даних запити до якого відбуваються з деяким нерівномірним \
розподілом."),
        paragraph("Іншою інформаційною системою у яку було інтегровано віддалену памʼять є застосунок, що обробляє запити до таблиці (dataframe) з даними подібно \
до типової системи аналізу даних чи бази даних. На початку своєї роботи, ця програма завантажує у памʼять набір даних з рейсами літаків взятий з Kaggle. \
Набор даних з 61 колонки розміщується у структурі даних вектор адаптованої для роботи з віддаленою памʼяттю. Ця інформаційна система обробляє запити \
згенеровані випадковим чином для фільтрації по даті, аеропорту та авіакомпанії. Для кожного запиту з набору даних обираються 10000 рейсів що \
відповідають критеріям та рахується середня звтримка прибуття літака у аеропорт призначення. Значення затримки повертається як відповідь на запит. \
Ця інформаційна система належить до класу програм що використовує структури даних адаптовані для роботи з віддаленою памʼяттю, обробляє дані у потоковому \
режимі та може обробляти дані (у цьому випадку - рядки) в будь-якому порядку."),

        subsection_header("Пропускна здатність різних класів програмного забезпечення"),
        paragraph("Для усіх трьох інформаційних систем що розглядаються було проведено вимірювання пропускної здатності в залежності від частки локальної \
памʼяті. Іншими словами, розмір набору даних, з яким працює програмне забезпечення є однаковим для усіх запусків програми одного типу, але розмір \
простору відведений для зберігання даних у локальній памʼяті обмежується певним процентом від розміру набору даних, інша частина зберігається у \
памʼяті віддалених вузлів. Значення пропускної здатності нормалізуються максимальною пропускною здатністю отриманою для типу програмного забезпечення \
з усіх проведених вимірювань."),
        paragraph("Результати вимірювання пропускної здатності наведено на графіку нижче."),

        Block::Image(ImageBlock::new(
            "./images/plot_demo_throughput.png".to_owned(),
            "Пропускна здатність програмного забезпечення в залежності від його типу та обсягу локальної памʼяті".to_owned()
        ).with_scaling(0.5)),
        paragraph("З цього графіку помітно, що зі зменшенням частки локальної памʼяті зменшується пропускна здатність програмного забезпечення. \
При цьому, інформаційна система що обробляє запити до таблиці (dataframe) з усіх програм що розглядалися мала найменше зниження швидкодії. Це пояснюється \
використанням структур даних адаптованих для роботи з віддаленою памʼяттю, що дозволило знизити кількість переміщень проміжків між локальною памʼяттю \
та памʼяттю віддалених вузлів."),
        paragraph("Порівняння рівня швидкодії для програми що генерує текст та веб сервісу приводить до висновку що віддалена памʼять є більш ефективною \
для програмного забезпечення що працює з великими обʼєктами та незмінними схемами доступу до памʼяті."),
        paragraph("Крім цього, цей графік показує що зі зниженням частки локальної памʼяті рівень швидкодії програмного забезпечення наближується до 18% \
від максимального. Це ..."),
        // todo: explain that 0.2 is because of network/CPU throughput.

        // todo: tell that I also was able to verify that integration is simple enough with llm inference application.

        Block::SubsectionHeader(SubsectionHeaderBlock::without_numbering("Висновки до розділу".to_owned())),
        Block::Placeholder(Box::new(paragraph("some text here")), "add some text here".to_owned()),
    ])
}
