use {
    crate::thesis::engine::{Block, ImageBlock, subsection_header, paragraph, unordered_list, section_header, SubsectionHeaderBlock},
    self::{
        research::research,
        method::far_memory_method,
    },
};

mod method;
mod research;

pub fn main_section() -> Block {
    /* from https://ela.kpi.ua/bitstream/123456789/49978/1/Mahisterska_dysertatsiia.pdf:
        Перший розділ містить порівняльний аналіз актуального наукового,
        інноваційного та практичного світового та вітчизняного здобутку у чіткій
        відповідності до теми магістерської дисертації. Для з'ясування стану розробки
        обраної теми складається огляд літератури, з якого можна зробити висновок, що
        дана тема ще не розкрита (розкрита лише частково, або не в тому аспекті) і тому
        вимагає подальшого розроблення. Якщо такий висновок не випливає логічно з
        огляду, то дисертанту немає сенсу розробляти обрану тему.
        В огляді необхідно:
        − окреслити основні етапи розвитку наукової думки за обраною
        сформульованою задачею;
        − стисло, критично висвітлити роботи попередників (переваги та недоліки,
        порівняльний аналіз отриманих раніше результатів, огляд аналогів на ринку
        схожих рішень або продуктів).
        Огляд літератури за темою демонструє ґрунтовне ознайомлення
        дисертанта зі спеціальною літературою, його вміння систематизувати джерела,
        критично їх розглядати, виділяти суттєве, оцінювати зроблене раніше іншими
        дослідниками, визначати головне у сучасному стані вивчення теми. Матеріали
        такого огляду треба систематизувати в певному логічному зв'язку і
        послідовності. Тому перелік праць (не менше 20-ти) та їх критичний розгляд не
        обов'язково подавати у хронологічному порядку. При цьому слід пам'ятати, що
        оскільки дисертація розкриває відносно вузьку тему, то огляд праць
        попередників роблять тільки з питань обраної теми, а не за проблемою в цілому.
        В огляді називають і критично оцінюють публікації, прямо і безпосередньо
        причетні до теми дисертації. Зайвим є виклад всього, що стало відомим
        дисертанту з прочитаного, і того, що побічно стосується його праці.
        Результатом проведеного аналізу має бути визначення тих питань, що
        залишились невирішеними, а отже і конкретизація даного дослідження у
        розв’язанні вказаної проблеми (завдання), та формулювання існуючих недоліків
        і напрямів їх подальшого усунення та вирішення, що забезпечує актуальність
        магістерського дослідження. Загальний обсяг огляду літератури не повинен
        перевищувати 20 % обсягу основної частини магістерської дисертації. */

    Block::Multiple(vec![
        research(),
        far_memory_method(),

        section_header("Опис програмного та технічного забезпечення"),
        Block::Placeholder(Box::new(paragraph("some text here")), "add some text here".to_owned()),

        section_header("Маркетинговий аналіз стартап-проекту"),
        Block::Placeholder(Box::new(paragraph("some text here")), "add some text here".to_owned()),
    ])
}
